#define _IN_WDT_


#include"custom.h"

void init_wdt(void);
void feed_wdt(void);
/*********************************************************************************************
*
*
*
*********************************************************************************************/
void init_wdt()
{
  LPC_WDT -> WDMOD = 0;
  //feed_wdt();

  LPC_WDT -> WDCLKSEL = 0x1;
  //WDCLKSEL		bit1	bit0
  //				  0		  0		  选择内部RC振荡器(irc_clk)作为看门狗的时钟源,默认
  //				  0		  1		  选择APB外设时钟(看门狗PCLK)作为看门狗的时钟源
  //				  1		  0		  选择RTC振荡器(rtc_clk)作为看门狗的时钟源
  //				  1		  1		  保留,不使用该设置
  //WDCLKSEL		bit31	  0		  任意复位发送生该位就变为0,该位不能通过软件清零
  //WDCLKSEL		bit31	  1		  软件可将该位置1,只要WDLOCK置位,该寄存器中的位就不能被修改
  LPC_WDT -> WDTC= 0x112a880;	  //3s		 6000 per 1ms
  LPC_WDT -> WDMOD = 3;
  feed_wdt();
  //NVIC_SetPriority(WDT_IRQn, 1);
  //NVIC_EnableIRQ(WDT_IRQn);         // 设置中断并使能 
//  wdt_tst_cnt=0;
}
/*********************************************************************************************
*
*
*
*********************************************************************************************/
void feed_wdt()
{
  //NVIC_DisableIRQ(TIMER0_IRQn);                  //设置中断并使能 
  LPC_WDT -> WDFEED = 0xaa;
  LPC_WDT -> WDFEED = 0x55;
  //NVIC_EnableIRQ(TIMER0_IRQn);                  //设置中断并使能 
}
/*********************************************************************************************
*
*
*
*********************************************************************************************/




