/*
************************Copyright(c)************************
*	  			   湖南一特股份有限公司
*			       	All Rights Reserved
*			     		 
*
*-----------------------文件信息---------------------------
*文件名称     		:Key.c
*文件描述    		:听筒监控程序
*创建人     		:尹运同
*创建日期   		:2008-9-22
*版本号       		:V1.0
*注释	     		:
*----------------------------------------------------------
*修改人  			:
*修改日期  			:
*版本号        		:
*注释	     		:
***********************************************************
*/
#define _IN_KEY_
#include "config.h"

/**********************************************************
*函数名称			:KeyDown	
*函数描述        	:电源按键按下处理函数
*输入参数   		:
*返回值				:   	
*全局变量			:
*调用模块  			:
***********************************************************
*创建人	      		:尹运同
*创建日期	 		:2008-9-22
***********************************************************
*修改人	  			:
*修改日期    		:
*注释		      	:
**********************************************************/ 
void KeyDown(void)
{
	if(bPowerEnState)
	{//24V电源打开状态
		bPowerEnState=0;
		POWER_EN =0;
		
		LED_POWER = 1;	//关电源指示灯
		
		LED_STATE =1;	//关状态指示灯
		bLedState =1;
	}
	else
	{//24V电源关闭状态
		EA=0;
		while(1);	//不喂狗,使系统重启
		
		bPowerEnState=1;
		POWER_EN =1;
		
		LED_POWER = 0;	//开电源指示灯
		

		LED_STATE =0;	//开状态指示灯
		bLedState =0;
	}
}
/**********************************************************
*函数名称			:KeyUp	
*函数描述        	:电源按键弹起处理函数
*输入参数   		:
*返回值				:   	
*全局变量			:
*调用模块  			:
***********************************************************
*创建人	      		:尹运同
*创建日期	 		:2008-9-22
***********************************************************
*修改人	  			:
*修改日期    		:
*注释		      	:
**********************************************************/ 
void KeyUp(void)
{

}

