/*
************************Copyright(c)************************
*	  			   湖南一特电子股份有限公司
*			       	All Rights Reserved
*			     		 
*
*-----------------------文件信息---------------------------
*文件名称     		:Key.c
*文件描述    		:按键驱动程序
*创建人     		:尹运同
*创建日期   		:2008-9-22
*版本号       		:V1.0
*注释	     		:采用按键与灯显示控制共用一个I/O口的方式					
*----------------------------------------------------------
*修改人  			:
*修改日期  			:
*版本号        		:
*注释	     		:
***********************************************************
*/
#define _IN_KEY_
#include "config.h"

bit bPrgState;
					
/**********************************************************
*函数名称			:SetLedDealState	
*函数描述        	:设置处理灯状态
*输入参数   		:byState:灯状态
*返回值				:   	
*全局变量			:
*调用模块  			:
***********************************************************
*创建人	      		:尹运同
*创建日期	 		:2008-9-22
***********************************************************
*修改人	  			:
*修改日期    		:
*注释		      	:
**********************************************************/
void SetLedState(uint8 byState)
{
	PRG_STATE = (bit)byState;
	bPrgState = (bit)byState;
}


/**********************************************************
*函数名称			:KeyScan	
*函数描述        	:按键扫描函数
*输入参数   		:
*返回值				:NO_KEY:无按键按下,SET_KEY:设置键按下
					 DEAL_KEY:处置键按下   	
*全局变量			:
*调用模块  			:
***********************************************************
*创建人	      		:尹运同
*创建日期	 		:2008-9-22
***********************************************************
*修改人	  			:
*修改日期    		:
*注释		      	:
**********************************************************/
uint8 KeyScan(void)
{
	if(0 == KEY_COPY)
	{
		return(COPY_KEY_VAL);
	}
 	

	_nop_(); 
	_nop_(); 						
	_nop_(); 
	_nop_();
	_nop_(); 
	_nop_(); 						
	_nop_(); 
	_nop_();

	return(NO_KEY_VAL);	
} 
/**********************************************************
*函数名称			:KeyManager	
*函数描述        	:按键管理线程
*输入参数   		:
*返回值				: 	
*全局变量			:byMainCmdQ
*调用模块  			:KeyScan,OSQPost
***********************************************************
*创建人	      		:尹运同
*创建日期	 		:2008-9-22
***********************************************************
*修改人	  			:
*修改日期    		:
*注释		      	:
**********************************************************/
void KeyManager(void)
{ 	
	static uint8 byKeyValue;
	static uint8 byKeyDelay;
	
    while(TRUE)
    {
        OSWait(K_TMO, OS_TICKS_PER_SEC/50); 				//20ms延时          					   
        byKeyValue = KeyScan();              			
        if(NO_KEY_VAL== byKeyValue)
        {			       	
        	continue;
        }        
        OSWait(K_TMO, OS_TICKS_PER_SEC/50);    				//20ms延时消抖       					
        if(byKeyValue != KeyScan())
        { 			
            continue;
        }
        OSQPost(byMainCmdQ, KEY_DOWN|byKeyValue);

		byKeyDelay = KEY_DELAY;
		while(byKeyDelay--)
		{
			if(byKeyValue == KeyScan())
			{	
				OSWait(K_TMO, OS_TICKS_PER_SEC/50); 
			}
			else
			{ 	
				goto KeyUp;
			}
		}		
		OSQPost(byMainCmdQ, KEY_ALWAYS|byKeyValue);				                                              
        while(byKeyValue == KeyScan())
        {	
			OSWait(K_TMO, OS_TICKS_PER_SEC/20);  			       
        }
KeyUp:
		OSQPost(byMainCmdQ, KEY_UP|byKeyValue);			
    }
}
/**********************************************************
*函数名称			:KeyDownDeal	
*函数描述        	:按键按下处理函数
*输入参数   		:byKey:按下键的键值
*返回值				: 	
*全局变量			:stLocalControl
*调用模块  			:Bus0OutputData
***********************************************************
*创建人	      		:尹运同
*创建日期	 		:2008-9-22
***********************************************************
*修改人	  			:
*修改日期    		:
*注释		      	:
**********************************************************/
void KeyDownDeal(uint8 byKey)
{ 
	byKey	&= 0x0f;
	
	switch(byKey)
	{
		case COPY_KEY_VAL:	
			break;
			
	}

		
}
/**********************************************************
*函数名称			:KeyUpDeal	
*函数描述        	:按键弹起处理函数
*输入参数   		:byKey:弹起键的键值
*返回值				: 	
*全局变量			:
*调用模块  			:MakeCH0TimerOut,MakeCH1TimerOut
***********************************************************
*创建人	      		:尹运同
*创建日期	 		:2008-9-22
***********************************************************
*修改人	  			:
*修改日期    		:
*注释		      	:
**********************************************************/
void KeyUpDeal(uint8 byKey)
{
	byKey&= 0x0f;

	switch(byKey)
	{
		case COPY_KEY_VAL:
			break;
		}

}
/**********************************************************
*函数名称			:KeyAlwaysDeal	
*函数描述        	:按键长按下处理函数
*输入参数   		:byKey:长按键的键值
*返回值				: 	
*全局变量			:stLocalControl
*调用模块  			:
***********************************************************
*创建人	      		:尹运同
*创建日期	 		:2008-9-22
***********************************************************
*修改人	  			:
*修改日期    		:
*注释		      	:
**********************************************************/
void KeyAlwaysDeal(uint8 byKey)
{
	byKey	&= 0x0f;
	
	switch(byKey)
	{
		case COPY_KEY_VAL:

			break;
	}

}
